; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 555227 2 2 4 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	infrared3 - mode
	image1 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation1 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite1 Planet5)
	(have_image Planet5 spectrograph0)
	(have_image Phenomenon6 infrared3)
	(have_image Star7 thermograph2)
	(have_image Planet8 image1)
	(have_image Phenomenon9 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 star4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
4. (turn_to satellite0 star7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
5. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 6
6. (turn_to satellite1 star7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star7)
   goals met: 0 of 6
7. (take_image satellite1 star7 instrument2 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 1 of 6
8. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 1 of 6
9. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   goals met: 2 of 6
10. (take_image satellite1 planet5 instrument2 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 3 of 6
11. (turn_to satellite1 phenomenon6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 6
12. (take_image satellite1 phenomenon6 instrument2 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 3 of 6
13. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 3 of 6
14. (turn_to satellite1 planet8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet8)
   goals met: 3 of 6
15. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 6
16. (turn_to satellite1 groundstation1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 6
17. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 3 of 6
18. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 3 of 6
19. (take_image satellite1 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 4 of 6
20. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   goals met: 5 of 6
21. (turn_to satellite1 phenomenon9 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 6
22. (take_image satellite1 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 5 of 6
23. (turn_to satellite1 planet5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet5)
   goals met: 6 of 6
